In [ ]:

import pandas as pd
import numpy as np
import datetime as dt

In [ ]:
pip install pandas_ods_reader

Collecting pandas_ods_reader
  Downloading https://files.pythonhosted.org/packages/d9/f8/c1097f90411ec2cdfee9686c469a8acabff678185d761345975fc559c9fc/pandas_ods_reader-0.0.7-py3-none-any.whl
Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (from pandas_ods_reader) (4.2.6)
Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (from pandas_ods_reader) (1.0.5)
Collecting ezodf
  Downloading https://files.pythonhosted.org/packages/6f/c5/e966935c26d58d7e3d962270be61be972409084374d4093f478d1f82e8af/ezodf-0.3.2.tar.gz (125kB)
     |████████████████████████████████| 133kB 3.7MB/s
Requirement already satisfied: python-dateutil>=2.6.1 in /usr/local/lib/python3.6/dist-packages (from pandas->pandas_ods_reader) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas->pandas_ods_reader) (2018.9)
Requirement already satisfied: numpy>=1.13.3 in /usr/local/lib/python3.6/dist-packages (from pandas->pandas_ods_reader) (1.18.5)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.6.1->pandas->pandas_ods_reader) (1.15.0)
Building wheels for collected packages: ezodf
  Building wheel for ezodf (setup.py) ... done
  Created wheel for ezodf: filename=ezodf-0.3.2-py2.py3-none-any.whl size=49001 sha256=4558417712098ecb9707553930542bf86bc8a42ea2a122ec94a63ca39a35337f
  Stored in directory: /root/.cache/pip/wheels/c9/6c/f9/107d39d45441980bf273757eba003ef057c6193c9d7650fac7
Successfully built ezodf
Installing collected packages: ezodf, pandas-ods-reader
Successfully installed ezodf-0.3.2 pandas-ods-reader-0.0.7

In [ ]:
from pandas_ods_reader import read_ods

In [ ]:
pip install odfpy

Collecting odfpy
  Downloading https://files.pythonhosted.org/packages/97/73/8ade73f6749177003f7ce3304f524774adda96e6aaab30ea79fd8fda7934/odfpy-1.4.1.tar.gz (717kB)
     |████████████████████████████████| 727kB 2.8MB/s
Requirement already satisfied: defusedxml in /usr/local/lib/python3.6/dist-packages (from odfpy) (0.6.0)
Building wheels for collected packages: odfpy
  Building wheel for odfpy (setup.py) ... done
  Created wheel for odfpy: filename=odfpy-1.4.1-py2.py3-none-any.whl size=160692 sha256=7b54388eb574fcac9dc05ceea7d1c3e452813479615590c087d7d641438a043a
  Stored in directory: /root/.cache/pip/wheels/ce/6b/93/ec330f2991c5f1546abf640360e5a2022f76cb16e5d99ed2fd
Successfully built odfpy
Installing collected packages: odfpy
Successfully installed odfpy-1.4.1

In [ ]:
df1 = pd.read_excel("/content/Copper1.ods", engine="odf")
df2 = pd.read_excel("/content/Copper2.ods", engine="odf")
df3 = pd.read_excel("/content/zinc1.ods", engine="odf")
df4 = pd.read_excel("/content/zinc2.ods", engine="odf")

In [ ]:
df4.tail()

           Time  Zinc_fut
2287 2020-06-22    163.05
2288 2020-06-23    161.45
2289 2020-06-24    161.10
2290 2020-06-25    163.70
2291 2020-06-26    166.00

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2029 entries, 0 to 2028
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Time         2029 non-null   datetime64[ns]
 1   Copper_spot  2029 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 31.8 KB

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2073 entries, 0 to 2072
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Time       2073 non-null   datetime64[ns]
 1   Zinc_Spot  2073 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 32.5 KB

In [ ]:
df1['Time']=pd.to_datetime(df1['Time'])
df2['Time']=pd.to_datetime(df2['Time'])
df3['Time']=pd.to_datetime(df3['Time'])
df4['Time']=pd.to_datetime(df4['Time'])

In [ ]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2073 entries, 0 to 2072
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Time       2073 non-null   datetime64[ns]
 1   Zinc_Spot  2073 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 32.5 KB

In [ ]:


df1['Time'] = pd.to_datetime(df1['Time'].dt.date)

df2['Time'] = pd.to_datetime(df2['Time'].dt.date)

df3['Time'] = pd.to_datetime(df3['Time'].dt.date)

df4['Time'] = pd.to_datetime(df4['Time'].dt.date)

In [ ]:
df1

           Time  Copper_spot
0    2012-04-09       427.15
1    2012-04-10       420.55
2    2012-04-11       412.05
3    2012-04-12       413.60
4    2012-04-13       421.95
...         ...          ...
2024 2020-03-16       417.80
2025 2020-03-17       415.15
2026 2020-03-18       393.50
2027 2020-03-19       367.85
2028 2020-03-20       388.30

[2029 rows x 2 columns]

In [ ]:
df5 = df2.merge(df1, how='outer', left_on='Time',right_on='Time')

In [ ]:
df5 = df5.sort_values(['Time'],ascending=[True])

In [ ]:
df5.head(100
         )

         Time  Copper_fut  Copper_spot
0  2012-01-06      407.00          NaN
1  2012-01-07      407.15          NaN
2  2012-01-09      403.20          NaN
3  2012-01-10      399.55          NaN
4  2012-01-11      400.05          NaN
..        ...         ...          ...
95 2012-04-28      414.75          NaN
96 2012-04-30      415.05       443.65
97 2012-05-01      416.20       443.85
98 2012-05-02      418.25       445.00
99 2012-05-03      424.75       441.90

[100 rows x 3 columns]

In [ ]:
df6 = df3.merge(df4, how='outer', left_on='Time',right_on='Time')
df6 = df6.sort_values(['Time'],ascending=[True])

In [ ]:
df6

           Time  Zinc_Spot  Zinc_fut
2073 2012-01-04        NaN     99.00
2074 2012-01-05        NaN     98.20
2075 2012-01-06        NaN     98.80
2076 2012-01-07        NaN     98.10
2077 2012-01-09        NaN     97.85
...         ...        ...       ...
2289 2020-06-22        NaN    163.05
2290 2020-06-23        NaN    161.45
2291 2020-06-24        NaN    161.10
2292 2020-06-25        NaN    163.70
2293 2020-06-26        NaN    166.00

[2294 rows x 3 columns]

In [ ]:
df7 = df5.merge(df6, how='outer', left_on='Time',right_on='Time')
df7 = df7.sort_values(['Time'],ascending=[True])

In [ ]:
df7

           Time  Copper_fut  Copper_spot  Zinc_Spot  Zinc_fut
2292 2012-01-04         NaN          NaN        NaN     99.00
2293 2012-01-05         NaN          NaN        NaN     98.20
0    2012-01-06      407.00          NaN        NaN     98.80
1    2012-01-07      407.15          NaN        NaN     98.10
2    2012-01-09      403.20          NaN        NaN     97.85
...         ...         ...          ...        ...       ...
2287 2020-06-22      449.25          NaN        NaN    163.05
2288 2020-06-23      448.65          NaN        NaN    161.45
2289 2020-06-24      447.10          NaN        NaN    161.10
2290 2020-06-25      451.25          NaN        NaN    163.70
2291 2020-06-26      457.15          NaN        NaN    166.00

[2294 rows x 5 columns]

In [ ]:
df7['Weekday'] = df7['Time'].apply(lambda x: x.weekday())
df7['Weekday'].unique()

array([2, 3, 4, 5, 0, 1, 6])

In [ ]:
df11.head()

   PRICE_TIN  Timestamp  PRICE_NICKEL  ...  PRICE_ZINC  PRICE_LEAD  Weekday
0      358.0 2005-02-03         645.0  ...         NaN         NaN        3
1      354.0 2005-02-14         677.0  ...         NaN         NaN        0
2        NaN 2005-03-01           NaN  ...         NaN         NaN        1
3      354.5 2005-04-29         734.0  ...         NaN         NaN        4
4      354.5 2005-04-30         734.0  ...         NaN         NaN        5

[5 rows x 8 columns]

In [ ]:
## Monday = 0, to Sunday = 6, removing Saturday = 5 and Sunday = 6
df7 = df7[df7['Weekday']!=5]
df7 = df7[df7['Weekday']!=6]

In [ ]:
df7['Weekday'].unique()

array([2, 3, 4, 0, 1])

In [ ]:
map = {0:'Monday',
       1:'Tuesday',
       2:'Wednesday',
       3:'Thursday',
       4:'Friday'}

In [ ]:
df11['Weekday'] = df11['Weekday'].map(map)

In [ ]:
df11 = df11.reset_index(drop = True)
df11

      PRICE_TIN  Timestamp  PRICE_NICKEL  ...  PRICE_ZINC  PRICE_LEAD    Weekday
0        358.00 2005-02-03         645.0  ...         NaN         NaN   Thursday
1        354.00 2005-02-14         677.0  ...         NaN         NaN     Monday
2           NaN 2005-03-01           NaN  ...         NaN         NaN    Tuesday
3        354.50 2005-04-29         734.0  ...         NaN         NaN     Friday
4        354.50 2005-05-02         734.0  ...         NaN         NaN     Monday
...         ...        ...           ...  ...         ...         ...        ...
4017    1157.25 2020-05-18         892.0  ...      155.15       141.6     Monday
4018    1165.50 2020-05-19         892.0  ...      155.15       141.6    Tuesday
4019    1160.50 2020-05-20         892.0  ...      155.15       141.6  Wednesday
4020    1194.25 2020-05-21         892.0  ...      155.15       141.6   Thursday
4021    1174.25 2020-05-22         892.0  ...      155.15       141.6     Friday

[4022 rows x 8 columns]

In [ ]:
df7

           Time  Copper_fut  Copper_spot  Zinc_Spot  Zinc_fut  Weekday
2292 2012-01-04         NaN          NaN        NaN     99.00        2
2293 2012-01-05         NaN          NaN        NaN     98.20        3
0    2012-01-06      407.00          NaN        NaN     98.80        4
2    2012-01-09      403.20          NaN        NaN     97.85        0
3    2012-01-10      399.55          NaN        NaN     98.15        1
...         ...         ...          ...        ...       ...      ...
2287 2020-06-22      449.25          NaN        NaN    163.05        0
2288 2020-06-23      448.65          NaN        NaN    161.45        1
2289 2020-06-24      447.10          NaN        NaN    161.10        2
2290 2020-06-25      451.25          NaN        NaN    163.70        3
2291 2020-06-26      457.15          NaN        NaN    166.00        4

[2172 rows x 6 columns]

In [ ]:
df11.to_excel('Final_Data_1.xlsx')

In [ ]:
df7['Copper_fut'] = df7['Copper_fut'].interpolate()

In [ ]:
df7['Copper_spot'] = df7['Copper_spot'].interpolate()

In [ ]:
df7['Zinc_Spot'] = df7['Zinc_Spot'].interpolate()

In [ ]:
df7['Zinc_fut'] = df7['Zinc_fut'].interpolate()

In [ ]:
df7

           Time  Copper_fut  Copper_spot  Zinc_Spot  Zinc_fut  Weekday
2292 2012-01-04         NaN          NaN        NaN     99.00        2
2293 2012-01-05         NaN          NaN        NaN     98.20        3
0    2012-01-06      407.00          NaN        NaN     98.80        4
2    2012-01-09      403.20          NaN        NaN     97.85        0
3    2012-01-10      399.55          NaN        NaN     98.15        1
...         ...         ...          ...        ...       ...      ...
2287 2020-06-22      449.25        388.3     155.15    163.05        0
2288 2020-06-23      448.65        388.3     155.15    161.45        1
2289 2020-06-24      447.10        388.3     155.15    161.10        2
2290 2020-06-25      451.25        388.3     155.15    163.70        3
2291 2020-06-26      457.15        388.3     155.15    166.00        4

[2172 rows x 6 columns]

In [ ]:
df11['PRICE_ZINC'] = df11['PRICE_ZINC'].interpolate()

In [ ]:
df11['PRICE_LEAD'] = df11['PRICE_LEAD'].interpolate()

In [ ]:
df11.index = df11['Timestamp']

In [ ]:
df11['PRICE_ZINC'] = df11['PRICE_ZINC'].interpolate(method='time')

In [ ]:
df11['PRICE_LEAD'] = df11['PRICE_LEAD'].interpolate(method='time')

In [ ]:
df11

            PRICE_TIN  Timestamp  ...  PRICE_LEAD    Weekday
Timestamp                         ...
2005-02-03     358.00 2005-02-03  ...         NaN   Thursday
2005-02-14     354.00 2005-02-14  ...         NaN     Monday
2005-03-01     354.25 2005-03-01  ...         NaN    Tuesday
2005-04-29     354.50 2005-04-29  ...         NaN     Friday
2005-05-02     354.50 2005-05-02  ...         NaN     Monday
...               ...        ...  ...         ...        ...
2020-05-18    1157.25 2020-05-18  ...       141.6     Monday
2020-05-19    1165.50 2020-05-19  ...       141.6    Tuesday
2020-05-20    1160.50 2020-05-20  ...       141.6  Wednesday
2020-05-21    1194.25 2020-05-21  ...       141.6   Thursday
2020-05-22    1174.25 2020-05-22  ...       141.6     Friday

[4022 rows x 8 columns]

In [ ]:
df7.to_excel('Final_Data_FRAM.xlsx')